#include<cstdio>
#define MOD 1000000007

int n;
int dp[10001][4][3];
// i번째 계단을 오르는데 j 칸 넘어서 온 케이스에 k(3 이상은 2로 취급)번 연속으로 1~2칸 짜리 씀

int main()
{
    dp[1][1][1] = 1; // 1
    dp[2][1][2] = 1; // 1 1
    dp[2][2][1] = 1; // 2
    dp[3][1][2] = 2; // 1 1 1, 2 1
    dp[3][2][2] = 1; // 1 2 
    dp[3][3][0] = 1; // 3
    scanf("%d", &n);
    for(int i=4 ; i<=n ; i++) {
        dp[i][1][1] = dp[i-1][3][0]; // 3 1
        dp[i][1][2] = (dp[i-1][1][1] + dp[i-1][2][1] + dp[i-1][1][2] + dp[i-1][2][2]) % MOD; // 1 1 1 1, 1 2 1, 2 1 1
        dp[i][2][1] = dp[i-2][3][0]; // X
        dp[i][2][2] = (dp[i-2][1][1] + dp[i-2][1][2] + dp[i-2][2][1] + dp[i-2][2][2]) % MOD; // 1 1 2, 2 2
        dp[i][3][0] = (dp[i-3][1][2] + dp[i-3][2][2]) % MOD; // 1 3
    }
    printf("%d", (dp[n][1][1] + dp[n][1][2] + dp[n][2][1] + dp[n][2][2] + dp[n][3][0]) % MOD);
}